<html>
    <head>
        <title>William Ivanski - Spartacus</title>
        
        <link rel="shortcut icon" type="image/x-icon" href="logo.ico" />
        
        <meta http-equiv="content-type" content="text/html; charset=utf-8" />
        <meta name="keywords" content="" />
        <meta name="description" content="" />
        
        <link href="style.css" rel="stylesheet" type="text/css" media="screen" />
        
        <script>
        (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
        })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
        ga('create', 'UA-54648306-2', 'auto');
        ga('send', 'pageview');
        </script>
        
        <script src="https://apis.google.com/js/platform.js" async defer>
          {lang: 'pt-BR'}
        </script>
    </head>
    
    <body>
        <!--
        <script type='text/javascript' >var qadserve_width  = '120';var qadserve_height = '600';var qadserve_pid = 'd2bc423f-b2f5-4c25-bf77-5cc65fee85e0'; var qadserve_direction = 'left';var qadserve_from_top = 60;</script><script type='text/javascript'  src='http://mmrm.qadserve.com/qadserve_slider.min.js'></script>
        <script type='text/javascript' >var qadserve_width  = '120';var qadserve_height = '600';var qadserve_pid = 'e18cf5ea-2e8f-49d4-a182-6e080741f818'; var qadserve_direction = 'right';var qadserve_from_top = 60;</script><script type='text/javascript'  src='http://mmrm.qadserve.com/qadserve_slider.min.js'></script>
        -->

        <div id="logo">
            <h1>William Ivanski</h1>
            <h2>Desenvolvendo software de qualidade desde 2006</h2>
        </div>
        
        <div id="menu">
            <ul>
                <li class="first"><a href="index.html" accesskey="1" title="In&iacute;cio">In&iacute;cio</a></li>
                <li><a class="current" href="projetos.html" accesskey="2" title="Projetos">Projetos</a></li>
                <li><a href="artigos.html" accesskey="3" title="Artigos">Artigos</a></li>
                <li><a href="sobremim.html" accesskey="4" title="Sobre mim">Sobre mim</a></li>
            </ul>
        </div>
        <hr />
        
        <!-- start page -->
        <div id="page">
        
            <!-- start content -->
            <div id="content">

                <div class="post">
                    <h2 class="title">
                        Lan&ccedil;ada vers&atilde;o 0.38.0 da Biblioteca Spartacus&nbsp;&nbsp;&nbsp;
                        <div class="g-plusone" data-annotation="inline" data-width="300" data-href="http://williamivanski.com.br/spartacus.html"></div></br>
                    </h2>
                    <div class="entry">
                        <p>O desenvolvimento da Spartacus est&aacute; tomando propor&ccedil;&otilde;es cada vez maiores. J&aacute; ultrapassamos 160 mil linhas de c&oacute;digo. Voc&ecirc; poder&aacute; fazer download da Spartacus 0.38.0 clicando <a href="spartacus/Spartacus-0.38.0.zip">nesse link</a>.</p>
                        <p>Para ajudar a organizar o desenvolvimento e a corre&ccedil;&atilde;o de bugs, criamos um <a href="https://trello.com/b/qIQ5id41/spartacus">Trello Board p&uacute;blico</a>, onde voc&ecirc; poder&aacute; ver quais s&aacute;o alguns de meus planos para essa biblioteca, e tamb&eacute;m acompanhar o progresso de cada tarefa.</p>
                        <p>Toda a documenta&ccedil;o das classes agora poder ser acessada online atrav&eacute;s <a href="spartacus/html/index.html">desse link</a>. Tamb&eacute;m comecei a centralizar os artigos e manuais explicativos da Spartacus na <a href="https://github.com/wind39/spartacus/wiki">wiki do projeto no GitHub</a>.</p>
                        <p>Segue lista de mudan&ccedil;as:</p>
                        <ul>
                            <li><b>Spartacus.Net.Cryptor:</b></li>
                                <ul>
                                    <li>Implementada fun&ccedil;&atilde;o para obter strings aleat&oacute;rias para diversos prop&oacute;sitos.</li>
                                    <br/>
                                </ul>
                            <li><b>Spartacus.Database:</b></li>
                                <ul>
                                    <li>Suporte ao Mono 4.0;</li>
                                    <li>Sobrecarga para a fun&ccedil;&atilde;o Query, que agora consegue buscar dados em blocos. Isso reduz o uso de mem&oacute;ria quando h&aacute; muitos dados para trazer do banco.</li>
                                    <br/>
                                </ul>
                            <li><b>Spartacus.Utils.Excel:</b></li>
                                <ul>
                                    <li>Suporte a mais f&oacute;rmulas;</li>
                                    <li>Tabelas din&acirc;micas agora podem ser agrupadas por mais de uma coluna;</li>
                                    <li>Suporte &agrave; op&ccedil;&atilde;o "Quebrar texto automaticamente";</li>
                                    <li>Suporte a coment&aacute;rios nas c&eacute;lulas;</li>
                                    <li>Formata&ccedil;&atilde;o condicional para linhas baseado no valor de uma coluna;</li>
                                    <li>Incorporado c&oacute;digo-fonte da EPPlus 4.0.4 para corrigir um bug NullReferenceException na classe ExcelRangeBase.</li>
                                    <br/>
                                </ul>
                            <li><b>Spartacus.Reporting:</b></li>
                                <ul>
                                    <li>Suporte a bordas no cabe&ccedil;alho e rodap&eacute; do relat&oacute;rio;</li>
                                    <li>Objetos de texto agora podem ser centralizados;</li>
                                    <li>Caracteres acentuados agora s&aacute;o renderizados corretamente. Se os dados do banco vierem com HTML Encoding, a convers&aacute;o &eacute; autom&aacute;tica;</li>
                                    <li>Incorporado c&oacute;digo-fonte da PDFjet 5.28, e com isso n&oacute;s:</li>
                                    <ul>
                                        <li>Removemos a depend&ecirc;ncia da Windows Forms para cortar o texto para caber na c&eacute;lula;</li>
                                        <li>Reduzido uso de mem&oacute;ria em aproximadamente 50% para renderizar relat&oacute;rios em PDF;</li>
                                        <li>Reduzido tempo de processamento em aproximadamente 75% para renderizar relat&oacute;rios em PDF;</li>
                                        <li>Agora um relat&oacute;rio com aproximadamente 350 mil registros e 10 mil p&aacute;ginas &eacute; renderizado em menos de 15 minutos em uma m&aacute;quina modesta de 32 bits, um &uacute;nico processador e 3 GB RAM.</li>
                                    </ul>
                                </ul>
                            <br/>
                            <li>E muito mais otimiza&ccedil;&otilde;es e corre&ccedil;&otilde;es de bugs.</li>
                        </ul>
                    </div>
                    <p class="meta">Curitiba, 6 de maio de 2015.</p>
                    <script src="https://apis.google.com/js/plusone.js">
                    </script>
                    <g:comments
                        href="http://williamivanski.com.br/spartacus.html"
                        width="642"
                        first_party_property="BLOGGER"
                        view_type="FILTERED_POSTMOD">
                    </g:comments>
                </div>

                <div class="post">
                    <h2 class="title">
                        Lan&ccedil;ada vers&atilde;o 0.36.0 da Biblioteca Spartacus&nbsp;&nbsp;&nbsp;
                        <div class="g-plusone" data-annotation="inline" data-width="300" data-href="http://williamivanski.com.br/spartacus.html"></div></br>
                    </h2>
                    <div class="entry">
                        <p>Estou disponibilizando para <a href="spartacus/Spartacus-0.36.0.zip">download</a> a <b>Spartacus 0.36.0</b>, bem como sua documenta&ccedil;&atilde;o, em um pacote &uacute;nico.</p>
                        <p>Segue lista das principais mudan&ccedil;as:</p>
                        <ul>
                            <li>Implementada tabela din&acirc;mica no cabe&ccedil;alho de um relat&oacute;rio XLSX;</li>
                            <li>Suporte a N linhas em qualquer se&ccedil;&atilde;o de um relat&oacute;rio PDF;</li>
                            <li>Implementada Spartacus.Database.Oracle: conex&atilde;o a um banco de dados Oracle sem necessidade de ODBC ou OLEDB;</li>
                            <li>Diversas otimiza&ccedil;&otilde;es e corre&ccedil;&otilde;es de bugs.</li>
                        </ul>
                    </div>
                    <p class="meta">Curitiba, 19 de mar&ccedil;o de 2015.</p>
                    <script src="https://apis.google.com/js/plusone.js">
                    </script>
                    <g:comments
                        href="http://williamivanski.com.br/spartacus.html"
                        width="642"
                        first_party_property="BLOGGER"
                        view_type="FILTERED_POSTMOD">
                    </g:comments>
                </div>

                <div class="post">
                    <h2 class="title">
                        Lan&ccedil;ada vers&atilde;o 0.35.2 da Biblioteca Spartacus&nbsp;&nbsp;&nbsp;
                        <div class="g-plusone" data-annotation="inline" data-width="300" data-href="http://williamivanski.com.br/spartacus.html"></div></br>
                    </h2>
                    <div class="entry">
                        <p>Estou disponibilizando para <a href="spartacus/Spartacus-0.35.2.zip">download</a> a <b>Spartacus 0.35.2</b>, bem como sua <a href="spartacus/Spartacus-0.35.2.pdf">documenta&ccedil;&atilde;o</a>.</p>
                        <p>Mais uma vez, diversas novas funcionalidades foram implementadas e v&aacute;rios bugs foram corrigidos. Tenho novamente o orgulho de disponibilizar a Spartacus aqui no site, para quem n&atilde;o est&aacute; acompanhando o projeto no Github, onde publico quase toda semana.</p>
                        <p>Segue lista das principais mudan&ccedil;as desde a vers&atilde;o 0.32.0:</p>
                        <ul>
                            <li>Implementada funcionalidade de exportar planilhas do XLSX a partir de um DataTable e um arquivo template XLSX existente;</li>
                            <li>Novos componentes para <b>Spartacus.Forms</b>: Passwordbox, Memobox, Datetimepicker e Filepicker.</li>
                            <li>Na <b>Spartacus.Reporting</b>, foi corrigido um bug em que o texto ficava "encavalado" quando era maior do que a coluna, e foi otimizado o tempo de renderiza&ccedil;&atilde;o, pois agora busca a imagem do cabe&ccedil;lho das p&aacute;ginas apenas uma vez, replicando para as demais p&aacute;ginas;</li>
                            <li>Tamb&eacute;m na <b>Spartacus.Reporting</b>, foi implementada a funcionalidade de calcular os totalizadores dos grupos automaticamente, sem precisar passar esses valores na consulta;</li>
                            <li>Implementados "pacotes" de relat&oacute;rios Excel e PDF;</li>
                            <li><b>Spartacus.Utils.Excel</b> agora consegue gerar arquivos XLSX sem necessidade de template, usando apenas o DataTable;</li>
                            <li>Gera&ccedil;&atilde;o de relat&oacute;rios em Excel e PDF agora possuem evento de progresso, em que &eacute; poss&iacute;vel acompanhar o percentual de renderiza&ccedil;&atilde;o de cada relat&oacute;rio.</li>
                        </ul>
                    </div>
                    <p class="meta">Curitiba, 18 de fevereiro de 2015.</p>
                    <script src="https://apis.google.com/js/plusone.js">
                    </script>
                    <g:comments
                        href="http://williamivanski.com.br/spartacus.html"
                        width="642"
                        first_party_property="BLOGGER"
                        view_type="FILTERED_POSTMOD">
                    </g:comments>
                </div>
            
                <div class="post">
                    <h2 class="title">
                        Lan&ccedil;ada vers&atilde;o 0.32.0 da Biblioteca Spartacus&nbsp;&nbsp;&nbsp;
                        <div class="g-plusone" data-annotation="inline" data-width="300" data-href="http://williamivanski.com.br/spartacus.html"></div></br>
                    </h2>
                    <div class="entry">
                        <p>Estou disponibilizando para <a href="spartacus/Spartacus-0.32.0.zip">download</a> a <b>Spartacus 0.32.0</b>, bem como sua <a href="spartacus/Spartacus-0.32.0.pdf">documenta&ccedil;&atilde;o</a>.</p>
                        <p>Muita coisa mudou desde a &uacute;ltima vers&atilde;o que eu disponibilizei aqui no site, 0.30.0. Note que a vers&atilde;o 0.31.0 n&atilde;o chegou a ser publicada aqui. O motivo disso &eacute; que a vers&atilde;o 0.31.0 foi utilizada em produ&ccedil;&atilde;o, mas foram descobertos alguns problemas e eu n&atilde;o julguei est&aacute;vel o suficiente para disponibilizar para voc&ecirc;s.</p>
                        <p>Segue lista de mudan&ccedil;as:</p>
                        <ul>
                            <li>Removida depend&ecirc;ncia de <b>Mono.Security.dll</b>, que causava problemas ao utilizar <b>WebClient</b>;</li>
                            <li>Implementada funcionalidade <b>BulkInsert</b> para <b>Spartacus.Database</b>, para inserir dados em massa em bancos de dados;</li>
                            <li>Adicionada classe <b>Spartacus.Utils.ErrorEvent</b>, para tratar eventos de erro em seu aplicativo;</li>
                            <li>Exce&ccedil;&otilde;es padronizadas e agora mostram <b>stacktrace</b>, para facilitar a depura&ccedil;&atilde;o do seu c&oacute;digo;</li>
                            <li>Removida depend&ecirc;ncia de <b>ICSharpCode.SharpZipLib</b>, cuja licen&ccedil;a n&atilde;o era boa para projetos comerciais. Agora foi incorporado o c&oacute;digo da <b>ZipStorer</b>, que permite compactar e descompactar arquivos zip;</li>
                            <li>Removida depend&ecirc;ncia de <b>EPPlus</b>. Ao inv&eacute;s disso, foi incorporado o c&oacute;digo da <b>SejExcel</b>, que consegue ler e escrever arquivos XLSX 100 vezes mais r&aacute;pido do que a EPPlus (&eacute; verdade, eu testei!);</li>
                            <li>Criado namespace <b>Spartacus.ThirdParty</b>, para armazenar c&oacute;digos de bibliotecas de terceiros;</li>
                            <li>Mesclada classe <b>Spartacus.Utils.CSVTable</b> dentro da classe <b>Spartacus.Utils.Excel</b>;</li>
                            <li>Diversas corre&ccedil;&otilde;es de bugs e otimiza&ccedil;&otilde;es de uso de mem&oacute;ria.</li>
                        </ul>
                    </div>
                    <p class="meta">Curitiba, 23 de outubro de 2014.</p>
                    <script src="https://apis.google.com/js/plusone.js">
                    </script>
                    <g:comments
                        href="http://williamivanski.com.br/spartacus.html"
                        width="642"
                        first_party_property="BLOGGER"
                        view_type="FILTERED_POSTMOD">
                    </g:comments>
                </div>

                <div class="post">
                    <h2 class="title">
                        Biblioteca Spartacus&nbsp;&nbsp;&nbsp;
                        <div class="g-plusone" data-annotation="inline" data-width="300" data-href="http://williamivanski.com.br/spartacus.html"></div></br>
                    </h2>
                    <div class="entry">
                        <p>&Eacute; com muita satisfa&ccedil;&atilde;o que eu informo a todos que publiquei a minha <b>biblioteca Spartacus</b> no <b>GitHub</b>!!</p>
                        <p>Para quem n&atilde;o sabe, o <b>GitHub</b> &eacute; o maior reposit&oacute;rio de projetos de c&oacute;digo aberto do mundo. Hospeda o c&oacute;digo-fonte de projetos importantes, como o <a href="https://github.com/mono/mono">Mono</a>, o <a href="https://github.com/jquery/jquery">JQuery</a> e at&eacute; mesmo o <a href="https://github.com/torvalds/linux">kernel do Linux</a>, que pertence a Linus Torvalds, o criador do Linux.</p>
                        <p>A Spartacus &eacute; uma biblioteca em C# que venho desenvolvendo h&aacute; quase 4 anos. Comecei a desenvolver em casa por <em>hobbie</em>, quando percebi que estava tendo que escrever muito c&oacute;digo repetido para tarefas semelhantes no meu dia-a-dia. O c&oacute;digo todo j&aacute; chegou a ter mais de 20 mil linhas, e ent&atilde;o eu separei em duas partes: criei uma segunda camada somente com c&oacute;digo de manipula&ccedil;&atilde;o de arquivos NF-e, SPED e outras <em>expertises</em> do meu emprego. Essa segunda camada n&atilde;o &eacute; p&uacute;blica, pertence ao meu contratante.</p>
                        <p>A primeira camada da Spartacus, que estou abrindo sob a licen&ccedil;a MIT, tem cerca de 12 mil linhas de c&oacute;digo, e se beneficia de algumas outras bibliotecas tamb&eacute;m de c&oacute;digo aberto. Abrir a Spartacus foi a forma que eu encontrei de retribuir &agrave; comunidade e respeitar suas licen&ccedil;as e seus cr&eacute;ditos.</p>
                        <p>Por enquanto, a Spartacus possui os seguintes m&oacute;dulos:</p>
                        <ul>
                            <li><b>Spartacus.Database</b>: Cont&eacute;m encapsulamentos para acessar diversos bancos de dados diferentes de forma semelhante. Exemplos de SGBDs suportados: Firebird, PostgreSQL, MySQL, SQLite, Oracle (via ODBC) e muitos outros via ODBC e OLEDB.</li>
                            <li><b>Spartacus.Forms</b>: Permite o desenvolvimento r&aacute;pido de formul&aacute;rios e telas simples, sem a necessidade de usar designer de interfaces. Os componentes foram projetados para serem bem f&aacute;ceis de configurar.</li>
                            <li><b>Spartacus.Net</b>: Suporte para desenvolver aplicativos que se comunicam pela rede. Esquema cliente e servidor e defini&ccedil;&atilde;o de pacotes de dados.</li>
                            <li><b>Spartacus.Reporting</b>: <em>PDF Report Engine</em>, permite renderizar relat&oacute;rios em PDF a partir de um arquivo XML que cont&eacute;m a defini&ccedil;&atilde;o do layout do relat&oacute;rio e dados extra&iacute;dos com o m&oacute;dulo Spartacus.Database.</li>
                            <li><b>Spartacus.Utils</b>: Classes para extra&ccedil;&atilde;o de dados de arquivos do Microsoft Excel (CSV, XLS e XLSX) e outras coisas.</li>
                        </ul>
                        <p>O projeto j&aacute; est&aacute; na vers&atilde;o <b>0.30.0</b>, que em termos de coment&aacute;rios est&aacute; completamente documentada. Ainda preciso escrever um wiki no GitHub, elaborar manuais de utiliza&ccedil;&atilde;o, defini&ccedil;&atilde;o do layout XML para gera&ccedil;&atilde;o de relat&oacute;rios em PDF... Enfim, o projeto est&aacute; longe de ficar pronto, pelo contr&aacute;rio, agora &eacute; que est&aacute; come&ccedil;ando.</p>
                        <p>Criei uma p&aacute;gina espec&iacute;fica para a Spartacus aqui no site, e disponibilizarei aqui mesmo os bin&aacute;rios compilados para serem baixados gratuitamente. Voc&ecirc; at&eacute; j&aacute; pode baixar a <a href="spartacus/Spartacus-0.30.0.zip">vers&atilde;o 0.30.0</a>!!</p>
                        <p>Bom, o fato &eacute; que a Spartacus agora est&aacute; dispon&iacute;vel no <a href="https://github.com/wind39/spartacus">GitHub</a>. O c&oacute;digo-fonte &eacute; aberto sob a licen&ccedil;a MIT, o que significa que voc&ecirc; pode baixar e usar em seu aplicativo comercial. Esse &eacute; o primeiro projeto de c&oacute;digo aberto de minha autoria, e ainda estou aprendendo como esse mundo fascinante funciona!</p>
                    </div>
                    <p class="meta">Curitiba, 11 de setembro de 2014.</p>
                    <script src="https://apis.google.com/js/plusone.js">
                    </script>
                    <g:comments
                        href="http://williamivanski.com.br/spartacus.html"
                        width="642"
                        first_party_property="BLOGGER"
                        view_type="FILTERED_POSTMOD">
                    </g:comments>
                </div>
                
            </div>
            <!-- end content -->
            
            <!-- start sidebar -->
            <div id="sidebar">
                <div class="g-follow" data-annotation="bubble" data-height="20" data-href="//plus.google.com/u/0/113434597235835606932" data-rel="author"></div></br></br></br>
                <ul>
                    <li>
                        <h2><a href="spartacus.html">Biblioteca Spartacus</a></h2>
                        <ul>
                            <li><a href="https://github.com/wind39/spartacus">Projeto no GitHub</a></li>
                            <li><a href="https://github.com/wind39/spartacus/releases">Todas as Releases no GitHub</a></li>
                            <li><a href="spartacus/Spartacus-0.38.0.zip">Download vers&atilde;o 0.38.0</a></li>
                            <li><a href="https://github.com/wind39/spartacus/wiki">Wiki no GitHub</a></li>
                            <li><a href="https://trello.com/b/qIQ5id41/spartacus">Trello Board</a></li>
                            <li><a href="spartacus/html/index.html">Documenta&ccedil;&atilde;o Online</a></li>
                        </ul>
                    </li>
                </ul>
            </div>
            <!-- end sidebar -->
        </div>
        <!-- end page -->
        
        <div id="footer">
            <p class="legal">
                <a rel="license" href="http://creativecommons.org/licenses/by/4.0/"><img alt="Licença Creative Commons" style="border-width:0" src="https://i.creativecommons.org/l/by/4.0/88x31.png" /></a><br />Esta <span xmlns:dct="http://purl.org/dc/terms/" href="http://purl.org/dc/dcmitype/Dataset" rel="dct:type">obra</span> de <span xmlns:cc="http://creativecommons.org/ns#" property="cc:attributionName">William Ivanski</span> está licenciada com uma Licença <a rel="license" href="http://creativecommons.org/licenses/by/4.0/">Creative Commons Atribuição 4.0 Internacional</a>.
            </p>
            <p class="credit">Designed by <a href="http://www.nodethirtythree.com/">NodeThirtyThree</a> + <a href="http://www.freecsstemplates.org">FCT</a></p>
        </div>
    </body>
</html>
