<html>
    <head>
        <title>William Ivanski - Spartacus</title>
        
        <link rel="shortcut icon" type="image/x-icon" href="logo.ico" />
        
        <meta http-equiv="content-type" content="text/html; charset=utf-8" />
        <meta name="keywords" content="" />
        <meta name="description" content="" />
        
        <link href="style.css" rel="stylesheet" type="text/css" media="screen" />
        
        <script>
        (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
        })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
        ga('create', 'UA-54648306-2', 'auto');
        ga('send', 'pageview');
        </script>
        
        <script src="https://apis.google.com/js/platform.js" async defer>
          {lang: 'pt-BR'}
        </script>
    </head>
    
    <body>
        <div id="logo">
            <h1>William Ivanski</h1>
            <h2>Desenvolvendo software de qualidade desde 2006</h2>
        </div>
        
        <div id="menu">
            <ul>
                <li class="first"><a href="index.html" accesskey="1" title="In&iacute;cio">In&iacute;cio</a></li>
                <li><a class="current" href="projetos.html" accesskey="2" title="Projetos">Projetos</a></li>
                <li><a href="recomendacoes.html" accesskey="3" title="Recomenda&ccedil;&otilde;es">Recomenda&ccedil;&otilde;es</a></li>
                <li><a href="artigos.html" accesskey="4" title="Artigos">Artigos</a></li>
                <li><a href="sobremim.html" accesskey="5" title="Sobre mim">Sobre mim</a></li>
            </ul>
        </div>
        <hr />
        
        <!-- start page -->
        <div id="page">
        
            <!-- start content -->
            <div id="content">
            
                <div class="post">
                    <h2 class="title">
                        Biblioteca Spartacus&nbsp;&nbsp;&nbsp;
                        <div class="g-plusone" data-annotation="inline" data-width="300" data-href="http://williamivanski.com.br/spartacus.html"></div></br>
                    </h2>
                    <div class="entry">
                        <p>&Eacute; com muita satisfa&ccedil;&atilde;o que eu informo a todos que publiquei a minha <b>biblioteca Spartacus</b> no <b>GitHub</b>!!</p>
                        <p>Para quem n&atilde;o sabe, o <b>GitHub</b> &eacute; o maior reposit&oacute;rio de projetos de c&oacute;digo aberto do mundo. Hospeda o c&oacute;digo-fonte de projetos importantes, como o <a href="https://github.com/mono/mono">Mono</a>, o <a href="https://github.com/jquery/jquery">JQuery</a> e at&eacute; mesmo o <a href="https://github.com/torvalds/linux">kernel do Linux</a>, que pertence a Linus Torvalds, o criador do Linux.</p>
                        <p>A Spartacus &eacute; uma biblioteca em C# que venho desenvolvendo h&aacute; quase 4 anos. Comecei a desenvolver em casa por <em>hobbie</em>, quando percebi que estava tendo que escrever muito c&oacute;digo repetido para tarefas semelhantes no meu dia-a-dia. O c&oacute;digo todo j&aacute; chegou a ter mais de 20 mil linhas, e ent&atilde;o eu separei em duas partes: criei uma segunda camada somente com c&oacute;digo de manipula&ccedil;&atilde;o de arquivos NF-e, SPED e outras <em>expertises</em> do meu emprego. Essa segunda camada n&atilde;o &eacute; p&uacute;blica, pertence ao meu contratante.</p>
                        <p>A primeira camada da Spartacus, que estou abrindo sob a licen&ccedil;a MIT, tem cerca de 12 mil linhas de c&oacute;digo, e se beneficia de algumas outras bibliotecas tamb&eacute;m de c&oacute;digo aberto. Abrir a Spartacus foi a forma que eu encontrei de retribuir &agrave; comunidade e respeitar suas licen&ccedil;as e seus cr&eacute;ditos.</p>
                        <p>Por enquanto, a Spartacus possui os seguintes m&oacute;dulos:</p>
                        <ul>
                            <li><b>Spartacus.Database</b>: Cont&eacute;m encapsulamentos para acessar diversos bancos de dados diferentes de forma semelhante. Exemplos de SGBDs suportados: Firebird, PostgreSQL, MySQL, SQLite, Oracle (via ODBC) e muitos outros via ODBC e OLEDB.</li>
                            <li><b>Spartacus.Forms</b>: Permite o desenvolvimento r&aacute;pido de formul&aacute;rios e telas simples, sem a necessidade de usar designer de interfaces. Os componentes foram projetados para serem bem f&aacute;ceis de configurar.</li>
                            <li><b>Spartacus.Net</b>: Suporte para desenvolver aplicativos que se comunicam pela rede. Esquema cliente e servidor e defini&ccedil;&atilde;o de pacotes de dados.</li>
                            <li><b>Spartacus.Reporting</b>: <em>PDF Report Engine</em>, permite renderizar relat&oacute;rios em PDF a partir de um arquivo XML que cont&eacute;m a defini&ccedil;&atilde;o do layout do relat&oacute;rio e dados extra&iacute;dos com o m&oacute;dulo Spartacus.Database.</li>
                            <li><b>Spartacus.Utils</b>: Classes para extra&ccedil;&atilde;o de dados de arquivos do Microsoft Excel (CSV, XLS e XLSX) e outras coisas.</li>
                        </ul>
                        <p>O projeto j&aacute; est&aacute; na vers&atilde;o <b>0.30.0</b>, que em termos de coment&aacute;rios est&aacute; completamente documentada. Ainda preciso escrever um wiki no GitHub, elaborar manuais de utiliza&ccedil;&atilde;o, defini&ccedil;&atilde;o do layout XML para gera&ccedil;&atilde;o de relat&oacute;rios em PDF... Enfim, o projeto est&aacute; longe de ficar pronto, pelo contr&aacute;rio, agora &eacute; que est&aacute; come&ccedil;ando.</p>
                        <p>Criei uma p&aacute;gina espec&iacute;fica para a Spartacus aqui no site, e disponibilizarei aqui mesmo os bin&aacute;rios compilados para serem baixados gratuitamente. Voc&ecirc; at&eacute; j&aacute; pode baixar a <a href="spartacus/Spartacus-0.30.0.zip">vers&atilde;o 0.30.0</a>!!</p>
                        <p>Bom, o fato &eacute; que a Spartacus agora est&aacute; dispon&iacute;vel no <a href="https://github.com/wind39/spartacus">GitHub</a>. O c&oacute;digo-fonte &eacute; aberto sob a licen&ccedil;a MIT, o que significa que voc&ecirc; pode baixar e usar em seu aplicativo comercial. Esse &eacute; o primeiro projeto de c&oacute;digo aberto de minha autoria, e ainda estou aprendendo como esse mundo fascinante funciona!</p>
                    </div>
                    <p class="meta">Curitiba, 11 de setembro de 2014.</p>
                    <script src="https://apis.google.com/js/plusone.js">
                    </script>
                    <g:comments
                        href="http://williamivanski.com.br/spartacus.html"
                        width="642"
                        first_party_property="BLOGGER"
                        view_type="FILTERED_POSTMOD">
                    </g:comments>
                </div>
                
            </div>
            <!-- end content -->
            
            <!-- start sidebar -->
            <div id="sidebar">
                <div class="g-follow" data-annotation="bubble" data-height="20" data-href="//plus.google.com/u/0/113434597235835606932" data-rel="author"></div></br></br></br>
                <ul>
                    <li>
                        <h2><a href="curso.html">Curso de Programa&ccedil;&atilde;o C#</a></h2>
                        <ul>
                            <li><a target="_blank" href="https://plus.google.com/u/0/communities/102417267229322909418">Comunidade no Google+</a></li>
                            <li><a href="modulo1.html">M&oacute;dulo I</a></li>
                            <li><a href="modulo2.html">M&oacute;dulo II</a></li>
                            <li><a href="modulo3.html">M&oacute;dulo III</a></li>
                        </ul>
                    </li>
                    <li>
                        <h2><a href="spartacus.html">Biblioteca Spartacus</a></h2>
                        <ul>
                            <li><a href="https://github.com/wind39/spartacus">Projeto no GitHub</a></li>
                            <li><a href="spartacus/Spartacus-0.30.0.zip">Download vers&atilde;o 0.30.0</a></li>
                            <li><a href="spartacus/Spartacus-0.30.0.pdf">Documenta&ccedil;&atilde;o vers&atilde;o 0.30.0</a></li>
                        </ul>
                    </li>
                </ul>
            </div>
            <!-- end sidebar -->
        </div>
        <!-- end page -->
        
        <div id="footer">
            <p class="legal">
                <a rel="license" href="http://creativecommons.org/licenses/by/4.0/"><img alt="Licença Creative Commons" style="border-width:0" src="https://i.creativecommons.org/l/by/4.0/88x31.png" /></a><br />Esta <span xmlns:dct="http://purl.org/dc/terms/" href="http://purl.org/dc/dcmitype/Dataset" rel="dct:type">obra</span> de <span xmlns:cc="http://creativecommons.org/ns#" property="cc:attributionName">William Ivanski</span> está licenciada com uma Licença <a rel="license" href="http://creativecommons.org/licenses/by/4.0/">Creative Commons Atribuição 4.0 Internacional</a>.
            </p>
            <p class="credit">Designed by <a href="http://www.nodethirtythree.com/">NodeThirtyThree</a> + <a href="http://www.freecsstemplates.org">FCT</a></p>
        </div>
    </body>
</html>
